Tutoriels/interFoam/reconstructionSpectre/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

INLET
{

    alpha            alpha.water;

    waveModel        irregularMultiDirectional;

    nPaddle          1;

    rampTime         2.0;

    activeAbsorption yes;

    wavePeriods
    500
    (
(2.468260053622327)
(2.4609090567047303)
(2.453601715397469)
(2.4463376419633365)
(2.439116453243271)
(2.4319377705889895)
(2.4248012197968003)
(2.4177064310425798)
(2.41065303881789)
(2.4036406818672083)
(2.3966690031262488)
(2.3897376496613574)
(2.382846272609952)
(2.3759945271219927)
(2.369182072302458)
(2.362408571154807)
(2.355673690525409)
(2.348977101048925)
(2.3423184770946075)
(2.3356974967135256)
(2.32911384158667)
(2.3225671969739414)
(2.3160572516639917)
(2.309583697924908)
(2.3031462314557243)
(2.2967445513387372)
(2.2903783599926175)
(2.2840473631262976)
(2.277751269693624)
(2.271489791848757)
(2.2652626449023)
(2.259069547278155)
(2.252910220471081)
(2.2467843890049415)
(2.240691780391637)
(2.234632125090701)
(2.228605156469549)
(2.22261061076437)
(2.21664822704165)
(2.210717747160307)
(2.2048189157344393)
(2.198951480096663)
(2.193115190262037)
(2.187309798892559)
(2.181535061262224)
(2.175790735222636)
(2.1700765811691607)
(2.16439236200761)
(2.15873784312145)
(2.153112792339518)
(2.1475169799042506)
(2.141950178440396)
(2.136412162924219)
(2.1309027106531797)
(2.125421601216081)
(2.1199686164636757)
(2.1145435404797217)
(2.1091461595524876)
(2.103776262146685)
(2.0984336388758353)
(2.093118082475053)
(2.087829387774243)
(2.082567351671701)
(2.077331773108117)
(2.0721224530409637)
(2.0669391944192728)
(2.0617818021587904)
(2.0566500831175003)
(2.0515438460715125)
(2.046462901691312)
(2.041407062518356)
(2.036376142942022)
(2.031369959176893)
(2.0263883292403753)
(2.021431072930649)
(2.016498011804938)
(2.011588969158098)
(2.00670377000152)
(2.001842241042333)
(1.9970042106629171)
(1.992189508900706)
(1.9873979674282845)
(1.9826294195337715)
(1.9778837001014853)
(1.9731606455928852)
(1.9684600940277854)
(1.963781884965838)
(1.9591258594882777)
(1.954491860179928)
(1.9498797311114586)
(1.9452893178218973)
(1.9407204673013856)
(1.9361730279741778)
(1.9316468496818784)
(1.9271417836669145)
(1.922657682556238)
(1.9181944003452556)
(1.9137517923819816)
...
    );

    waveHeights
    500
    (
(0.0016981879890570158)
(0.0017327913027585387)
(0.001767417013878221)
(0.001802051340570955)
(0.0018366806912912285)
(0.0018712916751014834)
(0.0019058711113070278)
(0.0019404060384280368)
(0.001974883722520383)
(0.0020092916648579416)
(0.00204361760899012)
(0.0020778495471890333)
(0.0021119757263015656)
(0.0021459846530222037)
(0.0021798650986029943)
(0.0022136061030175423)
(0.002247196978596259)
(0.002280627313150435)
(0.0023138869726029494)
(0.0023469661031435157)
(0.0023798551329266083)
(0.002412544773330123)
(0.002445026019792893)
(0.002477290152249148)
(0.0025093287351778126)
(0.002541133617284471)
(0.00257269693083364)
(0.0026040110906486876)
(0.0026350687927966156)
(0.0026658630129745148)
(0.0026963870046142605)
(0.002726634296721716)
(0.0027565986914662405)
(0.0027862742615360936)
(0.0028156553472747873)
(0.002844736553613133)
(0.002873512746811327)
(0.0029019790510249046)
(0.002930130844708098)
(0.0029579637568675995)
(0.002985473663179331)
(0.0030126566819804394)
(0.0030395091701481683)
(0.003066027718876984)
(0.003092209149364755)
(0.0031180505084184317)
(0.003143549063989251)
(0.0031687023006469897)
(0.003193507915002459)
(0.0032179638110869887)
(0.0032420680956971996)
(0.003265819073713061)
(0.0032892152433967284)
(0.0033122552916793674)
(0.003334938089442753)
(0.003357262686802059)
(0.003379228308395954)
(0.0034008343486896914)
(0.0034220803672966147)
(0.0034429660843231812)
(0.0034634913757422034)
(0.0034836562687988186)
(0.003503460937453315)
(0.003522905697864692)
(0.003541991003918591)
(0.0035607174428028835)
(0.0035790857306340256)
(0.0035970967081370457)
(0.0036147513363816975)
(0.0036320506925772472)
(0.0036489959659279786)
(0.0036655884535514187)
(0.0036818295564610476)
(0.0036977207756150226)
(0.003713263708032362)
(0.003728460042977769)
(0.0037433115582161626)
(0.0037578201163378476)
(0.0037719876611550236)
(0.003785816214170317)
(0.003799307871117759)
(0.003812464798576607)
(0.0038252892306582537)
(0.0038377834657663144)
(0.0038499498634299834)
(0.003861790841210524)
(0.0038733088716807608)
(0.003884506479477336)
(0.003895386238425358)
(0.0039059507687350596)
(0.003916202734270008)
(0.003926144839886264)
(0.0039357798288419555)
(0.003945110480276555)
(0.003954139606759158)
(0.003962870051905042)
(0.003971304688059629)
(0.003979446414049086)
...
    );

    wavePhases
    500
    (
(0.07167607428825147)
(3.721494623369067)
(0.40329703273719986)
(5.250028420638676)
(4.518279344382749)
(2.4081799687664525)
(1.5065940785294494)
(0.8709831609093613)
(4.640609656244537)
(2.4791116043489576)
(1.9644261111765682)
(2.187510791255807)
(0.2209615940917263)
(2.5895683253322614)
(2.811814564867896)
(0.08354202460545095)
(4.1445679908939175)
(2.2454916628976425)
(4.95673906337314)
(1.4043682342300896)
(0.8608060659775585)
(4.511307890019828)
(0.5875879587994411)
(0.20525203014281926)
(3.6706064461502526)
(2.119899596080845)
(2.976351815199997)
(4.130130074275564)
(5.688495821769747)
(2.3469102471975796)
(0.039079436448791194)
(5.975909679463676)
(3.996555887019342)
(5.303602928991684)
(0.3142470236319444)
(5.7846968880200045)
(0.9431445684473166)
(2.390363280939721)
(4.591259076118841)
(4.589322914229275)
(5.80836565577886)
(1.9717792839189974)
(4.999226012321995)
(2.34507379079758)
(2.535501110057312)
(3.5622028871974014)
(3.064963315402548)
(3.1307300507972577)
(0.22820669575855249)
(0.15507962111821186)
(4.24920090999342)
(5.542438510721264)
(2.56901143584525)
(3.46245587787607)
(0.5342428918777098)
(3.578139249667499)
(4.6457004586056225)
(1.2362548499054575)
(6.163172029844635)
(2.882626997972408)
(2.2894916834653314)
(5.402815326376818)
(5.965658621640004)
(5.086162329604912)
(5.038630628614596)
(2.2189872608573165)
(3.863736392768961)
(3.271488746734678)
(4.511343680282951)
(3.9179966551391487)
(5.914140728842031)
(4.1211036077362575)
(4.447898814776137)
(4.126219689133821)
(4.260657961944947)
(1.8448467144026006)
(1.8108087355057887)
(1.7562735952269133)
(1.7852083152740685)
(2.500820598348871)
(5.2349510273884645)
(4.1292232905777215)
(3.5569543589278867)
(1.2289429708437534)
(4.863042415319586)
(4.196473683426406)
(6.220294194656408)
(6.15584600351431)
(3.9061647735522524)
(0.3330524235823187)
(5.34697763920865)
(5.597408732505374)
(2.1987087175411446)
(2.6055010743588323)
(0.19220364074638052)
(3.3174030161968453)
(2.9552269338946404)
(4.300770855351265)
...
    );

    waveDirs
    500
    (
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
...
    );

}

RIGHT
{

    alpha            alpha.water;

    waveModel        shallowWaterAbsorption;

    nPaddle          1;
}
